<?php

header('Content-Type: application/json');


$stories = [
    [
        "title" => "The Enchanted Forest",
        "author" => "ΑΝΤΩΝ ΤΣΕΧΩΦ",
        "year" => "1992",
        "content" => ""
    ],
    [
        "title" => "A Journey to the Stars",
        "author" => "John Smith",
        "year" => "1992",
        "content" => "In a distant galaxy far away..."
    ],
    [
        "title" => "The Sadness",
        "author" => "Anton Chechov",
        "year" => "1886",
        "content" => "Η ιστορία «Η Θλίψη» (ρωσικός τίτλος: Тоска) είναι ένα πραγματικό έργο του Άντον Τσέχωφ. Δημοσιεύτηκε για πρώτη φορά το 1886 στο ρωσικό περιοδικό Петербургская газета (Εφημερίδα της Αγίας Πετρούπολης).

Πρόκειται για ένα από τα πολλά σύντομα διηγήματά του, στα οποία ο Τσέχωφ αποτυπώνει με μαεστρία την ανθρώπινη μοναξιά, τη φτώχεια και την αδιαφορία της κοινωνίας για τον πόνο των άλλων. Αυτή η ιστορία είναι χαρακτηριστική του ύφους του, με λιτή αλλά συγκινητική αφήγηση που προκαλεί έντονα συναισθήματα."
    ],
    [

       "title" => "The Tell-Tale Heart",
       "author" => "Edgar Allan Poe",
       "year" => "1842",
       "content" =>" Μαρτυριάρα καρδιά (πρωτότυπος τίτλος:The Tell-Tale Heart) είναι διήγημα τρόμου του Αμερικανού συγγραφέα Έντγκαρ Άλαν Πόε, που δημοσιεύτηκε για πρώτη φορά στο περιοδικό της Βοστώνης The Pioneer τον Ιανουάριο του 1843.Το διήγημα είναι ένα από τα πιο γνωστά έργα του Πόε, αναγνωρίζεται ως κλασική ιστορία τρόμου και έχει διασκευαστεί για τον κινηματογράφο."
    ]
];

// Convert the PHP array to JSON and output it
echo json_encode($stories);

